AccumulationRegisters/АР_ВзаиморасчетыПоАренде.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccumulationRegister>
		<Properties>
			<Name>АР_ВзаиморасчетыПоАренде</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВзаиморасчетов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЗачетАванса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРасчетаПени</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОплаты</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ДокументРасчетовСКонтрагентом</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНаРасчетныйСчет</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРеализации</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолга</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КОРП_СчетНаАренду</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УслугаАренды</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектАренды</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ОбъектыАренды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетНаАренду</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АР_СчетНаАренду</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодАренды</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Депозит</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРасчетов</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СписаниеСРасчетногоСчета</v8:Type>
						<v8:Type>cfg:DocumentRef.ДокументРасчетовСКонтрагентом</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНаРасчетныйСчет</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРеализации</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолга</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.АР_НачислениеАренднойПлаты</v8:Type>
						<v8:Type>cfg:DocumentRef.АР_НачислениеПени</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пени</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/АР_СпособыПогашенияПени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>АР_СпособыПогашенияПени</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СперваПениПотомОсновнойДолг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СперваОсновнойДолгПотомПени</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВестиОбособленныйУчетПени</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/АР_УправлениеВзаиморасчетами/Ext/Module.bsl
// Функция получает таблицу остатков по взаиморасчетам аренды
Функция ПолучитьОстатокПоАренднымВзаиморасчетам(Реквизиты, ДополнительныеПараметры) Экспорт
	
	СтруктураПараметров = Новый Структура("УслугаАренды, СчетНаАренду, ПериодАренды, ОбъектАренды, Депозит, СпособПогашенияПени, ГраницаОстатков,
	|Период, Регистратор, Организация, Контрагент, ДоговорКонтрагента, НаправлениеДвижения");
	ЗаполнитьЗначенияСвойств(СтруктураПараметров, Реквизиты);
	ЗаполнитьЗначенияСвойств(СтруктураПараметров, ДополнительныеПараметры);
		
	Если Не ЗначениеЗаполнено(СтруктураПараметров.ГраницаОстатков) Тогда
		СтруктураПараметров.ГраницаОстатков = Новый МоментВремени(СтруктураПараметров.Период, СтруктураПараметров.Регистратор);
	КонецЕсли;
	
	Условие = "Организация = &Организация И Контрагент = &Контрагент";
	Если ЗначениеЗаполнено(СтруктураПараметров.ДоговорКонтрагента) Тогда
		
		ВестиВзаиморасчетыПоСчетамПост  = СтруктураПараметров.ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоСчетамПост;
		ВестиВзаиморасчетыПоСчетамПерем = СтруктураПараметров.ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоСчетамПерем;
		ВестиВзаиморасчетыПоПериодам    = СтруктураПараметров.ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоПериодам;
		ВестиВзаиморасчетыПоОбъектам    = СтруктураПараметров.ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоОбъектам;
		ВестиВзаиморасчетыПоУслугам     = СтруктураПараметров.ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоУслугам;
		
		Условие = Условие + " И ДоговорКонтрагента = &ДоговорКонтрагента";
		Если ВестиВзаиморасчетыПоУслугам И ЗначениеЗаполнено(СтруктураПараметров.УслугаАренды) Тогда
			Условие = Условие + " И Услуга = &УслугаАренды ";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтруктураПараметров.СчетНаАренду) Тогда
			Если ЗначениеЗаполнено(СтруктураПараметров.УслугаАренды) Тогда
				Если (СтруктураПараметров.УслугаАренды.АР_ПостояннаяЧастьОплаты И ВестиВзаиморасчетыПоСчетамПост ИЛИ
					Не СтруктураПараметров.УслугаАренды.АР_ПостояннаяЧастьОплаты И ВестиВзаиморасчетыПоСчетамПерем) Тогда
					Условие = Условие + " И СчетНаАренду = &СчетНаАренду ";
				КонецЕсли;
			Иначе
				Если ВестиВзаиморасчетыПоСчетамПост И ВестиВзаиморасчетыПоСчетамПерем Тогда
					Условие = Условие + " И СчетНаАренду = &СчетНаАренду ";
				ИначеЕсли ВестиВзаиморасчетыПоСчетамПост Тогда
					Условие = Условие + " И ((Услуга.АР_ПостояннаяЧастьОплаты И СчетНаАренду = &СчетНаАренду) ИЛИ НЕ Услуга.АР_ПостояннаяЧастьОплаты) ";
				ИначеЕсли ВестиВзаиморасчетыПоСчетамПерем Тогда
					Условие = Условие + " И ((НЕ Услуга.АР_ПостояннаяЧастьОплаты И СчетНаАренду = &СчетНаАренду) ИЛИ Услуга.АР_ПостояннаяЧастьОплаты) ";
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если ВестиВзаиморасчетыПоПериодам И ЗначениеЗаполнено(СтруктураПараметров.ПериодАренды) Тогда
			Условие = Условие + " И ПериодАренды = &ПериодАренды ";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтруктураПараметров.ОбъектАренды) И ВестиВзаиморасчетыПоОбъектам Тогда
			Условие = Условие + " И ОбъектАренды = &ОбъектАренды ";
		КонецЕсли;
		
	КонецЕсли;
	
	Если СтруктураПараметров.Депозит = Ложь Тогда
		Условие = Условие + " И Депозит = Ложь ";
	КонецЕсли;
	
	ЗнакОстатков = ?(СтруктураПараметров.НаправлениеДвижения = "Поступление" , 1, -1);
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НЕОПРЕДЕЛЕНО КАК Счет,
	|	ВложенныйЗапрос.Субконто1 КАК Контрагент,
	|	ВложенныйЗапрос.Субконто3 КАК ДокументРасчетов,
	|	ВложенныйЗапрос.Субконто3.Дата КАК ДатаДокументаРасчетов,
	|	ВложенныйЗапрос.ДоговорКонтрагента,
	|	ВложенныйЗапрос.Валюта КАК ВалютаВзаиморасчетов,
	|	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК Подразделение,
	|	ВложенныйЗапрос.УслугаАренды,
	|	ВложенныйЗапрос.ОбъектАренды,
	|	ВложенныйЗапрос.СчетНаАренду,
	|	ВложенныйЗапрос.ПериодАренды,
	|	ВложенныйЗапрос.Валюта,
	|	ВложенныйЗапрос.СуммаОстаток КАК СуммаБУ,
	|	ВложенныйЗапрос.СуммаНУОстаток КАК СуммаНУ,
	|	ВложенныйЗапрос.ВалютнаяСуммаОстаток КАК СуммаВзаиморасчетов,
	|	ВложенныйЗапрос.Депозит,
	|	ВложенныйЗапрос.Пени,
	|	0 КАК ОстатокВзаиморасчетов,
	|	0 КАК СуммаВзаиморасчетовЕНВД,
	|	0 КАК СуммаБУ_ЕНВД,
	|	0 КАК СуммаВзаиморасчетовПатент,
	|	0 КАК СуммаБУ_Патент,
	|	0 КАК СуммаВзаиморасчетовКомитента,
	|	0 КАК СуммаБУ_Комитента,
	|	0 КАК СуммаВзаиморасчетовТорговыйСбор,
	|	0 КАК СуммаБУ_ТорговыйСбор
	|ИЗ
	|	(ВЫБРАТЬ
	|		АР_ВзаиморасчетыПоАрендеОстатки.Контрагент КАК Субконто1,
	|		АР_ВзаиморасчетыПоАрендеОстатки.ДоговорКонтрагента КАК Субконто2,
	|		АР_ВзаиморасчетыПоАрендеОстатки.ДокументРасчетов КАК Субконто3,
	|		АР_ВзаиморасчетыПоАрендеОстатки.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|		АР_ВзаиморасчетыПоАрендеОстатки.Валюта КАК Валюта,
	|		АР_ВзаиморасчетыПоАрендеОстатки.УслугаАренды КАК УслугаАренды,
	|		АР_ВзаиморасчетыПоАрендеОстатки.ОбъектАренды КАК ОбъектАренды,
	|		АР_ВзаиморасчетыПоАрендеОстатки.СчетНаАренду КАК СчетНаАренду,
	|		АР_ВзаиморасчетыПоАрендеОстатки.ПериодАренды КАК ПериодАренды,
	|		АР_ВзаиморасчетыПоАрендеОстатки.Депозит КАК Депозит,
	|		АР_ВзаиморасчетыПоАрендеОстатки.Пени КАК Пени,
	|		ЕСТЬNULL(АР_ВзаиморасчетыПоАрендеОстатки.СуммаОстаток, 0) * &Множитель КАК СуммаОстаток,
	|		ЕСТЬNULL(АР_ВзаиморасчетыПоАрендеОстатки.СуммаНУОстаток, 0) * &Множитель КАК СуммаНУОстаток,
	|		ЕСТЬNULL(АР_ВзаиморасчетыПоАрендеОстатки.СуммаВзаиморасчетовОстаток, 0) * &Множитель КАК ВалютнаяСуммаОстаток,
	|		ВЫБОР
	|			КОГДА АР_ВзаиморасчетыПоАрендеОстатки.УслугаАренды.АР_УслугаАренды
	|				ТОГДА 0
	|			ИНАЧЕ 1
	|		КОНЕЦ КАК ПриоритетУслуги,
	|		ВЫБОР
	|			КОГДА АР_ВзаиморасчетыПоАрендеОстатки.Депозит
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ПриоритетСчета
	|	ИЗ
	|		РегистрНакопления.АР_ВзаиморасчетыПоАренде.Остатки(&Период, "+Условие+") КАК АР_ВзаиморасчетыПоАрендеОстатки
	|	ГДЕ
	|		ЕСТЬNULL(АР_ВзаиморасчетыПоАрендеОстатки.СуммаВзаиморасчетовОстаток, 0) * &Множитель > 0) КАК ВложенныйЗапрос
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВложенныйЗапрос.ПриоритетСчета,
	|	ВложенныйЗапрос.ПриоритетУслуги";
	
	Запрос.УстановитьПараметр("Период", СтруктураПараметров.ГраницаОстатков);                                
	Запрос.УстановитьПараметр("Организация", СтруктураПараметров.Организация);
	Запрос.УстановитьПараметр("Контрагент", СтруктураПараметров.Контрагент);
	Запрос.УстановитьПараметр("ДоговорКонтрагента", СтруктураПараметров.ДоговорКонтрагента);
	Запрос.УстановитьПараметр("СчетНаАренду", СтруктураПараметров.СчетНаАренду);
	Запрос.УстановитьПараметр("ПериодАренды", СтруктураПараметров.ПериодАренды);
	Запрос.УстановитьПараметр("ОбъектАренды", СтруктураПараметров.ОбъектАренды);
	Запрос.УстановитьПараметр("УслугаАренды", СтруктураПараметров.УслугаАренды);
		
	Запрос.УстановитьПараметр("Множитель", ЗнакОстатков);
	
	ОстаткиАвансов = Запрос.Выполнить().Выгрузить();
	
	Если ДополнительныеПараметры.Свойство("ДокументыРасчетовУСН") Тогда
		ДокументыРасчетовУСН = ДополнительныеПараметры.ДокументыРасчетовУСН;
		Для Каждого СтрокаАванса Из ОстаткиАвансов Цикл
			СтруктураУСН = ДокументыРасчетовУСН.Получить(СтрокаАванса.ДокументРасчетов);
			Если НЕ СтруктураУСН = Неопределено Тогда
				СтрокаАванса.СуммаВзаиморасчетовЕНВД		 = ?(СтруктураУСН.ЕстьОстаткиЕНВД, СтрокаАванса.СуммаВзаиморасчетов, 0);	
				СтрокаАванса.СуммаБУ_ЕНВД 			 		 = ?(СтруктураУСН.ЕстьОстаткиЕНВД, СтрокаАванса.СуммаБУ, 0);	
				СтрокаАванса.СуммаВзаиморасчетовПатент 		 = ?(СтруктураУСН.ЕстьОстаткиПатент, СтрокаАванса.СуммаВзаиморасчетов, 0);	
				СтрокаАванса.СуммаБУ_Патент 		 		 = ?(СтруктураУСН.ЕстьОстаткиПатент, СтрокаАванса.СуммаБУ, 0);	
				СтрокаАванса.СуммаВзаиморасчетовКомитента 	 = ?(СтруктураУСН.ЕстьОстаткиКомитента, СтрокаАванса.СуммаВзаиморасчетов, 0);	
				СтрокаАванса.СуммаБУ_Комитента 		 		 = ?(СтруктураУСН.ЕстьОстаткиКомитента, СтрокаАванса.СуммаБУ, 0);	
				СтрокаАванса.СуммаВзаиморасчетовТорговыйСбор = ?(СтруктураУСН.ЕстьОстаткиТорговыйСбор, СтрокаАванса.СуммаВзаиморасчетов, 0);	
				СтрокаАванса.СуммаБУ_ТорговыйСбор	 		 = ?(СтруктураУСН.ЕстьОстаткиТорговыйСбор, СтрокаАванса.СуммаБУ, 0);	
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ОбщегоНазначенияБПВызовСервера.УпорядочитьТаблицуПоДокументу(ОстаткиАвансов, "ДокументРасчетов", "ДатаДокументаРасчетов");
	Направление = ?(СтруктураПараметров.СпособПогашенияПени = Перечисления.АР_СпособыПогашенияПени.СперваПениПотомОсновнойДолг, "Убыв", "Возр");
	ОстаткиАвансов.Сортировать("Пени " + Направление);

	Возврат ОстаткиАвансов;

КонецФункции
